research/visualization_methods/outputs/Recurrent Switching Linear Dynamical System__rslds_model_learning/rslds_model_learning.dot
digraph G {
  "A" [label="A"];
  "B" [label="B"];
  "ContinuousTransition" [label="ContinuousTransition"];
  "DirichletCollection" [label="DirichletCollection"];
  "DiscreteTransition" [label="DiscreteTransition"];
  "GammaShapeRate" [label="GammaShapeRate"];
  "Gate" [label="Gate"];
  "H" [label="H"];
  "MultinomialPolya" [label="MultinomialPolya"];
  "MvNormalMeanCovariance" [label="MvNormalMeanCovariance"];
  "MvNormalMeanPrecision" [label="MvNormalMeanPrecision"];
  "P" [label="P"];
  "R" [label="R"];
  "Wishart" [label="Wishart"];
  "a_w" [label="a_w"];
  "a_w, b_w, Ψ_w, Ψ_R,ν_R, α, C" [label="a_w, b_w, Ψ_w, Ψ_R,ν_R, α, C"];
  "b_w" [label="b_w"];
  "get_hyperparameters" [label="get_hyperparameters"];
  "hyperparameters" [label="hyperparameters"];
  "obs" [label="obs"];
  "s" [label="s"];
  "softdot" [label="softdot"];
  "t" [label="t"];
  "u" [label="u"];
  "w" [label="w"];
  "x" [label="x"];
  "Λ" [label="Λ"];
  "Ψ_R" [label="Ψ_R"];
  "Ψ_w" [label="Ψ_w"];
  "α" [label="α"];
  "ν_R" [label="ν_R"];
  "ϕ" [label="ϕ"];
  "A" -> "x";
  "B" -> "x";
  "ContinuousTransition" -> "u";
  "ContinuousTransition" -> "x";
  "DirichletCollection" -> "P";
  "DiscreteTransition" -> "s";
  "GammaShapeRate" -> "R";
  "GammaShapeRate" -> "w";
  "Gate" -> "A";
  "Gate" -> "B";
  "MultinomialPolya" -> "s";
  "MvNormalMeanCovariance" -> "H";
  "MvNormalMeanCovariance" -> "x";
  "MvNormalMeanCovariance" -> "ϕ";
  "MvNormalMeanPrecision" -> "obs";
  "P" -> "s";
  "R" -> "obs";
  "Wishart" -> "R";
  "Wishart" -> "w";
  "Wishart" -> "Λ";
  "a_w" -> "w";
  "b_w" -> "w";
  "get_hyperparameters" -> "a_w, b_w, Ψ_w, Ψ_R,ν_R, α, C";
  "hyperparameters" -> "a_w, b_w, Ψ_w, Ψ_R,ν_R, α, C";
  "s" -> "s";
  "softdot" -> "u";
  "t" -> "s";
  "t" -> "u";
  "t" -> "x";
  "u" -> "s";
  "w" -> "u";
  "x" -> "u";
  "x" -> "x";
  "Ψ_R" -> "R";
  "Ψ_w" -> "w";
  "α" -> "P";
  "ν_R" -> "R";
  "ϕ" -> "u";
}
